Documents/_Инвойс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>_Инвойс</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсЗакупки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОтправкаИнвойсов</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>InformationRegister.Затраты</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ОприходованиеНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.СкорректированныеИнвойсы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсУстановленВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДокументСкидки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВКД_СкидкаПоставщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаЗакупкиСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Распределить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_НомерИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ДатаИнвойсаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвойсЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПоставок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВВалютеИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацииИнвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВКД_Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупкиСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИнвойса</Name>
							<Comment>Цена в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИДСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНаценкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/_Инвойс/Ext/ManagerModule.bsl
// © Primus1C  25.11.2023  НАЧАЛО ►

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	// закомментировано: медленная работа со списком документов
	
	//текПредставление = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ПредставлениеИнвойсов");
	//Если текПредставление = Перечисления.ПредставленияИнвойса.НомерДатаСумма Тогда
	//
	//	СтандартнаяОбработка = Ложь;

	//	Представление = СтрШаблон("%1 %2 от %3 (%4)",
	//							НСтр("ru = 'Инв.'; en = 'Inv.'"),
	//							Данные.Номер,
	//							Формат(Данные.Дата, "ДФ=dd.MM.yy"),
	//							Данные.Валюта.Символ + Формат(Данные.Сумма, "ЧДЦ=2")); 
	//							
	//ИначеЕсли текПредставление = Перечисления.ПредставленияИнвойса.НомерДатаСтатус Тогда
	//
	//	СтандартнаяОбработка = Ложь;
	//	
	//	Запись = регистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
	//	Запись.Инвойс = Данные.Ссылка;
	//	Запись.Прочитать();          
	//	Если Запись.Выбран() Тогда
	//		Статус = " (" + Запись.Статус + ")";
	//	Иначе
	//		Статус = "";	
	//	КонецЕсли;
	//	
	//	Представление = СтрШаблон("%1 %2 от %3%4",
	//							НСтр("ru = 'Инв.'; en = 'Inv.'"),
	//							Данные.Номер,
	//							Формат(Данные.Дата, "ДФ=dd.MM.yy"), 
	//							Статус);
	//							
	//ИначеЕсли текПредставление = Перечисления.ПредставленияИнвойса.НомерДатаСуммаСтатус Тогда
	//
	//	СтандартнаяОбработка = Ложь;
	//	
	//	Запись = регистрыСведений.СостоянияИнвойсов.СоздатьМенеджерЗаписи();
	//	Запись.Инвойс = Данные.Ссылка;
	//	Запись.Прочитать();          
	//	Если Запись.Выбран() Тогда
	//		Статус = " " + Запись.Статус;
	//	Иначе
	//		Статус = "";	
	//	КонецЕсли;
	//	
	//	Представление = СтрШаблон("%1 %2 от %3 (%4%5)",
	//							НСтр("ru = 'Инв.'; en = 'Inv.'"),
	//							Данные.Номер,
	//							Формат(Данные.Дата, "ДФ=dd.MM.yy"),
	//							Данные.Валюта.Символ + Формат(Данные.Сумма, "ЧДЦ=2"),
	//							Статус);
	//Иначе

	//КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Ссылка");  
	Поля.Добавить("Сумма");
	Поля.Добавить("Валюта");
	//Поля.Добавить("ВКД_Количество");
	
КонецПроцедуры



Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СПФ = Новый Структура("Инвойс", НСтр("ru='Инвойс';en='Invoice'")
							);		
							
	Возврат СПФ;						
							
КонецФункции 

Процедура ПечатьДокумента(ДокСсылка, ВариантПечатнойФормы, ТабДокумент, Параметры = 0) Экспорт
	
	ТабДокумент.Очистить();  
	Макет = Документы._Инвойс.ПолучитьМакет(ВариантПечатнойФормы);
	
	ЗапросШ = Новый Запрос;
	ЗапросШ.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапросШ.УстановитьПараметр("ПредставлениеДокумента",  ОбщегоНазначения.ПредставлениеДокументаДляПечати(ДокСсылка, ПолучитьСтруктуруПечатныхФорм()[ВариантПечатнойФормы]));
	ЗапросШ.УстановитьПараметр("ОтобразитьИмя", ОбщегоНазначенияПовтИсп.ДоступныНаименованияКонтрагентов());
	ЗапросШ.Текст = "ВЫБРАТЬ
	                |	Инвойс.Номер КАК Номер,
	                |	Инвойс.Дата КАК Дата,
	                |	ВЫБОР
	                |		КОГДА &ОтобразитьИмя
	                |			ТОГДА Инвойс.Контрагент
	                |		ИНАЧЕ Инвойс.Контрагент.Псевдоним
	                |	КОНЕЦ КАК Контрагент,
	                |	Инвойс.Сумма КАК Сумма,
	                |	Инвойс.СуммаВВалютеИнвойса КАК СуммаВВалютеИнвойса,
	                |	Инвойс.Валюта КАК Валюта,
	                |	Инвойс.ВКД_Количество КАК Количество,
	                |	Инвойс.ДокументОснование КАК ДокументОснование,
	                |	ВЫРАЗИТЬ(Инвойс.Примечание КАК СТРОКА(1000)) КАК Примечание,
	                |	&ПредставлениеДокумента КАК ПредставлениеДокумента,
	                |	Инвойс.ДокументОснование.НомерИнвойсаПоставщика КАК НомерИнвойса,
	                |	Инвойс.ДокументОснование.ДатаИнвойсаПоставщика КАК ДатаИнвойса,
	                |	Инвойс.ДокументОснование.ДатаНаСкладеОтправителя КАК ЕТА,
	                |	Инвойс.Валюта.Символ КАК ВалютаСимвол
	                |ИЗ
	                |	Документ._Инвойс КАК Инвойс
	                |ГДЕ
	                |	Инвойс.Ссылка = &Ссылка";
	Шапка = ЗапросШ.Выполнить().Выбрать();
	Шапка.Следующий();

	//глВывестиСекцию(ТабДокумент, Макет, "Шапка", Шапка);

	ЗапросТовары = Новый Запрос;
	ЗапросТовары.УстановитьПараметр("Ссылка", ДокСсылка);
	ЗапросТовары.Текст = "ВЫБРАТЬ
	                     |	ИнвойсТовары.Номенклатура КАК Номенклатура,
	                     |	ИнвойсТовары.ЦенаЗакупки КАК Цена,
	                     |	ИнвойсТовары.Количество КАК Количество,
	                     |	ИнвойсТовары.СуммаЗакупки КАК Сумма
	                     |ИЗ
	                     |	Документ._Инвойс.ВКД_Товары КАК ИнвойсТовары
	                     |ГДЕ
	                     |	ИнвойсТовары.Ссылка = &Ссылка";
	 ВыборкаТовары = ЗапросТовары.Выполнить().Выбрать(); 
	 ВсегоСтрок = ВыборкаТовары.Количество();
	 Ном = 0;
	 Пока ВыборкаТовары.Следующий() Цикл
	 	Ном = Ном + 1;
	 	Если Ном = 1 Тогда
			ИмяСекции = "Строка1";
			Пар = Шапка.Контрагент;
		ИначеЕсли Ном = 2 Тогда	
			ИмяСекции = "Строка";
			Пар = Шапка.НомерИнвойса;
		ИначеЕсли Ном = 3 Тогда	
			ИмяСекции = "Строка";
			Пар = Формат(Шапка.ДатаИнвойса, "ДФ=dd.MM.yyyy");
		ИначеЕсли Ном = 4 Тогда	
			ИмяСекции = "Строка";
			Пар = "ETA " + Шапка.ЕТА;
		Иначе
			ИмяСекции = "Строка";
			Пар = "";
		КонецЕсли;
	 	Обл = Макет.ПолучитьОбласть(ИмяСекции); 
		Обл.Параметры.Заполнить(ВыборкаТовары);  
		Обл.Параметры.Цена = Шапка.ВалютаСимвол + " " + Формат(ВыборкаТовары.Цена, "ЧДЦ=2");
		Обл.Параметры.Сумма = Шапка.ВалютаСимвол + " " + Формат(ВыборкаТовары.Сумма, "ЧДЦ=2");
		Обл.Параметры.Параметр = Пар;
		ТабДокумент.Вывести(Обл);
	КонецЦикла;  
	//Если ВсегоСтрок > 3 Тогда
	 	Обл = Макет.ПолучитьОбласть("Итог"); 
		Обл.Параметры.Параметр 		= "";
		Обл.Параметры.Количество 	= Шапка.Количество;
		Обл.Параметры.Сумма 		= Шапка.ВалютаСимвол + " " + Формат(Шапка.Сумма, "ЧДЦ=2"); 
		Обл.Параметры.Контрагент	= Шапка.Контрагент;
		Обл.Параметры.НомерИнвойса	= Шапка.НомерИнвойса;
		Обл.Параметры.ДатаИнвойса	= Шапка.ДатаИнвойса;
		ТабДокумент.Вывести(Обл);
	//КонецЕсли;

КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
